In [2]:
library("readxl")

In [7]:
raw <- read_excel("./Data_Examples/Sample1.xlsx")
raw

   ID SEX AGE AREA AMT17   Y17_CNT AMT16  Y16_CNT
1   1 F   50  서울 1300000 50      100000 40
2   2 M   40  경기  450000 25      700000 30
3   3 F   28  제주  275000 10       50000  5
4   4 M   50  서울  400000  8      125000  3
5   5 M   27  서울  845000 30      760000 28
6   6 F   23  서울   42900  1      300000  6
7   7 F   56  경기  150000  2      130000  2
8   8 F   47  서울  570000 10      400000  7
9   9 M   20  인천  930000  4      250000  2
10 10 F   38  경기  520000 17      550000 16

In [11]:
raw %>% select("ID", "SEX", "AGE")

   ID SEX AGE
1   1 F   50
2   2 M   40
3   3 F   28
4   4 M   50
5   5 M   27
6   6 F   23
7   7 F   56
8   8 F   47
9   9 M   20
10 10 F   38

------

In [9]:
library("dplyr")

Attaching package: ‘dplyr’

The following objects are masked from ‘package:stats’:

    filter, lag

The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union

In [23]:
raw_re <- rename(raw, Y17_AMT = AMT17, Y16_AMT = AMT16)
raw_re

   ID SEX AGE AREA Y17_AMT Y17_CNT Y16_AMT Y16_CNT
1   1 F   50  서울 1300000 50      100000  40
2   2 M   40  경기  450000 25      700000  30
3   3 F   28  제주  275000 10       50000   5
4   4 M   50  서울  400000  8      125000   3
5   5 M   27  서울  845000 30      760000  28
6   6 F   23  서울   42900  1      300000   6
7   7 F   56  경기  150000  2      130000   2
8   8 F   47  서울  570000 10      400000   7
9   9 M   20  인천  930000  4      250000   2
10 10 F   38  경기  520000 17      550000  16

------

In [24]:
raw_re$Total_AMT <- raw_re$Y17_AMT + raw_re$Y16_AMT 
raw_re

   ID SEX AGE AREA Y17_AMT Y17_CNT Y16_AMT Y16_CNT Total_AMT
1   1 F   50  서울 1300000 50      100000  40      1400000
2   2 M   40  경기  450000 25      700000  30      1150000
3   3 F   28  제주  275000 10       50000   5       325000
4   4 M   50  서울  400000  8      125000   3       525000
5   5 M   27  서울  845000 30      760000  28      1605000
6   6 F   23  서울   42900  1      300000   6       342900
7   7 F   56  경기  150000  2      130000   2       280000
8   8 F   47  서울  570000 10      400000   7       970000
9   9 M   20  인천  930000  4      250000   2      1180000
10 10 F   38  경기  520000 17      550000  16      1070000

In [25]:
raw_re$Total_CNT <- raw_re$Y17_CNT + raw_re$Y16_CNT 
raw_re

   ID SEX AGE AREA Y17_AMT Y17_CNT Y16_AMT Y16_CNT Total_AMT Total_CNT
1   1 F   50  서울 1300000 50      100000  40      1400000   90
2   2 M   40  경기  450000 25      700000  30      1150000   55
3   3 F   28  제주  275000 10       50000   5       325000   15
4   4 M   50  서울  400000  8      125000   3       525000   11
5   5 M   27  서울  845000 30      760000  28      1605000   58
6   6 F   23  서울   42900  1      300000   6       342900    7
7   7 F   56  경기  150000  2      130000   2       280000    4
8   8 F   47  서울  570000 10      400000   7       970000   17
9   9 M   20  인천  930000  4      250000   2      1180000    6
10 10 F   38  경기  520000 17      550000  16      1070000   33

In [26]:
raw_re$AMT_Avg. <- raw_re$Total_AMT / raw_re$Total_CNT 
raw_re

   ID SEX AGE AREA Y17_AMT Y17_CNT Y16_AMT Y16_CNT Total_AMT Total_CNT
1   1 F   50  서울 1300000 50      100000  40      1400000   90
2   2 M   40  경기  450000 25      700000  30      1150000   55
3   3 F   28  제주  275000 10       50000   5       325000   15
4   4 M   50  서울  400000  8      125000   3       525000   11
5   5 M   27  서울  845000 30      760000  28      1605000   58
6   6 F   23  서울   42900  1      300000   6       342900    7
7   7 F   56  경기  150000  2      130000   2       280000    4
8   8 F   47  서울  570000 10      400000   7       970000   17
9   9 M   20  인천  930000  4      250000   2      1180000    6
10 10 F   38  경기  520000 17      550000  16      1070000   33
   AMT_Avg.
1   15555.56
2   20909.09
3   21666.67
4   47727.27
5   27672.41
6   48985.71
7   70000.00
8   57058.82
9  196666.67
10  32424.24

------

In [28]:
raw_re$Over_50yrs <- ifelse(raw_re$AGE >= 50, "Yes", "No")
raw_re

   ID SEX AGE AREA Y17_AMT Y17_CNT Y16_AMT Y16_CNT Total_AMT Total_CNT
1   1 F   50  서울 1300000 50      100000  40      1400000   90
2   2 M   40  경기  450000 25      700000  30      1150000   55
3   3 F   28  제주  275000 10       50000   5       325000   15
4   4 M   50  서울  400000  8      125000   3       525000   11
5   5 M   27  서울  845000 30      760000  28      1605000   58
6   6 F   23  서울   42900  1      300000   6       342900    7
7   7 F   56  경기  150000  2      130000   2       280000    4
8   8 F   47  서울  570000 10      400000   7       970000   17
9   9 M   20  인천  930000  4      250000   2      1180000    6
10 10 F   38  경기  520000 17      550000  16      1070000   33
   AMT_Avg.  Over_50yrs
1   15555.56 Yes
2   20909.09 No
3   21666.67 No
4   47727.27 Yes
5   27672.41 No
6   48985.71 No
7   70000.00 Yes
8   57058.82 No
9  196666.67 No
10  32424.24 No

In [31]:
raw_re$Age_range <- ifelse(raw_re$AGE >= 50, "50+",
                           ifelse(raw_re$AGE >= 40, "40+",
                                 ifelse(raw_re$AGE >= 30, "30+",
                                       ifelse(raw_re$AGE >= 20, "20+", "20--"))))
raw_re

   ID SEX AGE AREA Y17_AMT Y17_CNT Y16_AMT Y16_CNT Total_AMT Total_CNT
1   1 F   50  서울 1300000 50      100000  40      1400000   90
2   2 M   40  경기  450000 25      700000  30      1150000   55
3   3 F   28  제주  275000 10       50000   5       325000   15
4   4 M   50  서울  400000  8      125000   3       525000   11
5   5 M   27  서울  845000 30      760000  28      1605000   58
6   6 F   23  서울   42900  1      300000   6       342900    7
7   7 F   56  경기  150000  2      130000   2       280000    4
8   8 F   47  서울  570000 10      400000   7       970000   17
9   9 M   20  인천  930000  4      250000   2      1180000    6
10 10 F   38  경기  520000 17      550000  16      1070000   33
   AMT_Avg.  Over_50yrs Age_range
1   15555.56 Yes        50+
2   20909.09 No         40+
3   21666.67 No         20+
4   47727.27 Yes        50+
5   27672.41 No         20+
6   48985.71 No         20+
7   70000.00 Yes        50+
8   57058.82 No         40+
9  196666.67 No         20+
10  32424.24 No         30+

------

In [48]:
raw_re %>% filter((AREA == "서울" | AREA == "경기") & Y17_CNT >= 5) %>% arrange(desc(SEX), AGE) %>% select(-Y16_AMT, -Y16_CNT, -Over_50yrs)

  ID SEX AGE AREA Y17_AMT Y17_CNT Total_AMT Total_CNT AMT_Avg. Age_range
1  5 M   27  서울  845000 30      1605000   58        27672.41 20+
2  2 M   40  경기  450000 25      1150000   55        20909.09 40+
3  4 M   50  서울  400000  8       525000   11        47727.27 50+
4 10 F   38  경기  520000 17      1070000   33        32424.24 30+
5  8 F   47  서울  570000 10       970000   17        57058.82 40+
6  1 F   50  서울 1300000 50      1400000   90        15555.56 50+

------

In [54]:
total_amt <- raw_re %>% summarise(Total_Y17_AMT = sum(Y17_AMT))
total_amt

  Total_Y17_AMT
1 5482900

In [58]:
arial_amt <- raw_re %>% group_by(AREA) %>% summarise(Total_Y17_AMT = sum(Y17_AMT))
arial_amt

  AREA Total_Y17_AMT
1 경기 1120000
2 서울 3157900
3 인천  930000
4 제주  275000

In [62]:
amt <- bind_rows(arial_amt, total_amt)
amt

  AREA Total_Y17_AMT
1 경기 1120000
2 서울 3157900
3 인천  930000
4 제주  275000
5 NA   5482900

------

In [57]:
total_cnt <- raw_re %>% summarise(Total_Y17_CNT = sum(Y17_CNT))
total_cnt

  Total_Y17_CNT
1 157

In [59]:
arial_cnt <- raw_re %>% group_by(AREA) %>% summarise(Total_Y17_CNT = sum(Y17_CNT))
arial_cnt

  AREA Total_Y17_CNT
1 경기 44
2 서울 99
3 인천  4
4 제주 10

In [63]:
cnt <- bind_rows(arial_cnt, total_cnt)
cnt

  AREA Total_Y17_CNT
1 경기  44
2 서울  99
3 인천   4
4 제주  10
5 NA   157

------

In [79]:
ac <- full_join(amt, cnt, by = "AREA")
ac

  AREA Total_Y17_AMT Total_Y17_CNT
1 경기 1120000        44
2 서울 3157900        99
3 인천  930000         4
4 제주  275000        10
5 NA   5482900       157

------

<table style="display: inline-block; align: center">
    <caption style="text-align: center;">병합 전: A</caption>
    <tr>
        <th>ID</th>
        <th>거주지</th>
    </tr>
    <tr>
        <td>1</td>
        <td>서울</td>
    </tr>
    <tr>
        <td>2</td>
        <td>부산</td>
    </tr>
    <tr style="color: red">
        <td style="color: red">3</td>
        <td>경주</td>
    </tr>
</table>

<table style="display: inline-block;">
    <caption style="text-align: center;">병합 전: B</caption>
    <tr>
        <th>ID</th>
        <th>성별</th>
    </tr>
    <tr>
        <td>1</td>
        <td>남</td>
    </tr>
    <tr>
        <td>2</td>
        <td>여</td>
    </tr>
    <tr style="color: red">
        <td>4</td>
        <td>남</td>
    </tr>
</table>


1. <code>left_join(A, B, by = "ID")</code>
    - A ∩ B<sup>c</sup>
    
    <table style="display: inline-block;">
        <caption style="text-align: center;">병합 후</caption>
        <tr>
            <th>ID</th>
            <th>거주지</th>
            <th>성별</th>
        </tr>
        <tr>
            <td>1</td>
            <td>서울</td>
            <td>남</td>
        </tr>
        <tr>
            <td>2</td>
            <td>부산</td>
            <td>여</td>
        </tr>
        <tr style="color: red">
            <td>3</td>
            <td>경주</td>
            <td>NA</td>
        </tr>
    </table>
    
    
2. <code>inner_join(A, B, by = "ID")</code>
    - A ∩ B
    
    <table style="display: inline-block;">
        <caption style="text-align: center;">병합 후</caption>
        <tr>
            <th>ID</th>
            <th>거주지</th>
            <th>성별</th>
        </tr>
        <tr>
            <td>1</td>
            <td>서울</td>
            <td>남</td>
        </tr>
        <tr>
            <td>2</td>
            <td>부산</td>
            <td>여</td>
        </tr>
    </table>
    
    
3. <code>full_join(A, B, by = "ID")</code>
    - A ∪ B
    
    <table style="display: inline-block;">
        <caption style="text-align: center;">병합 후</caption>
        <tr>
            <th>ID</th>
            <th>거주지</th>
            <th>성별</th>
        </tr>
        <tr>
            <td>1</td>
            <td>서울</td>
            <td>남</td>
        </tr>
        <tr>
            <td>2</td>
            <td>부산</td>
            <td>여</td>
        </tr>
        <tr style="color: red">
            <td>3</td>
            <td>경주</td>
            <td>NA</td>
        </tr>
        <tr style="color: red">
            <td>4</td>
            <td>NA</td>
            <td>남</td>
        </tr>
    </table>

In [80]:
amtcnt_lj <- left_join(raw_re, ac, by = "AREA")  # AREA 행을 기준으로 cnt를 amt에 결합
amtcnt_lj

   ID SEX AGE AREA Y17_AMT Y17_CNT Y16_AMT Y16_CNT Total_AMT Total_CNT
1   1 F   50  서울 1300000 50      100000  40      1400000   90
2   2 M   40  경기  450000 25      700000  30      1150000   55
3   3 F   28  제주  275000 10       50000   5       325000   15
4   4 M   50  서울  400000  8      125000   3       525000   11
5   5 M   27  서울  845000 30      760000  28      1605000   58
6   6 F   23  서울   42900  1      300000   6       342900    7
7   7 F   56  경기  150000  2      130000   2       280000    4
8   8 F   47  서울  570000 10      400000   7       970000   17
9   9 M   20  인천  930000  4      250000   2      1180000    6
10 10 F   38  경기  520000 17      550000  16      1070000   33
   AMT_Avg.  Over_50yrs Age_range Total_Y17_AMT Total_Y17_CNT
1   15555.56 Yes        50+       3157900       99
2   20909.09 No         40+       1120000       44
3   21666.67 No         20+        275000       10
4   47727.27 Yes        50+       3157900       99
5   27672.41 No         20+       3157900       99
6   48985.71 No         20+       3157900       99
7   70000.00 Yes        50+       1120000       44
8   57058.82 No         40+       3157900       99
9  196666.67 No         20+        930000        4
10  32424.24 No         30+       1120000       44

In [81]:
amtcnt_lj <- inner_join(raw_re, ac, by = "AREA")  # AREA 행을 기준으로 cnt를 amt에 결합
amtcnt_lj

   ID SEX AGE AREA Y17_AMT Y17_CNT Y16_AMT Y16_CNT Total_AMT Total_CNT
1   1 F   50  서울 1300000 50      100000  40      1400000   90
2   2 M   40  경기  450000 25      700000  30      1150000   55
3   3 F   28  제주  275000 10       50000   5       325000   15
4   4 M   50  서울  400000  8      125000   3       525000   11
5   5 M   27  서울  845000 30      760000  28      1605000   58
6   6 F   23  서울   42900  1      300000   6       342900    7
7   7 F   56  경기  150000  2      130000   2       280000    4
8   8 F   47  서울  570000 10      400000   7       970000   17
9   9 M   20  인천  930000  4      250000   2      1180000    6
10 10 F   38  경기  520000 17      550000  16      1070000   33
   AMT_Avg.  Over_50yrs Age_range Total_Y17_AMT Total_Y17_CNT
1   15555.56 Yes        50+       3157900       99
2   20909.09 No         40+       1120000       44
3   21666.67 No         20+        275000       10
4   47727.27 Yes        50+       3157900       99
5   27672.41 No         20+       3157900       99
6   48985.71 No         20+       3157900       99
7   70000.00 Yes        50+       1120000       44
8   57058.82 No         40+       3157900       99
9  196666.67 No         20+        930000        4
10  32424.24 No         30+       1120000       44

In [82]:
amtcnt_fj <- full_join(raw_re, ac, by = "AREA")  # AREA 행을 기준으로 모든 값을 결합
amtcnt_fj

   ID SEX AGE AREA Y17_AMT Y17_CNT Y16_AMT Y16_CNT Total_AMT Total_CNT
1   1 F   50  서울 1300000 50      100000  40      1400000   90
2   2 M   40  경기  450000 25      700000  30      1150000   55
3   3 F   28  제주  275000 10       50000   5       325000   15
4   4 M   50  서울  400000  8      125000   3       525000   11
5   5 M   27  서울  845000 30      760000  28      1605000   58
6   6 F   23  서울   42900  1      300000   6       342900    7
7   7 F   56  경기  150000  2      130000   2       280000    4
8   8 F   47  서울  570000 10      400000   7       970000   17
9   9 M   20  인천  930000  4      250000   2      1180000    6
10 10 F   38  경기  520000 17      550000  16      1070000   33
11 NA NA  NA  NA        NA NA          NA  NA           NA   NA
   AMT_Avg.  Over_50yrs Age_range Total_Y17_AMT Total_Y17_CNT
1   15555.56 Yes        50+       3157900        99
2   20909.09 No         40+       1120000        44
3   21666.67 No         20+        275000        10
4   47727.27 Yes        50+       3157900        99
5   27672.41 No         20+       3157900        99
6   48985.71 No         20+       3157900        99
7   70000.00 Yes        50+       1120000        44
8   57058.82 No         40+       3157900        99
9  196666.67 No         20+        930000         4
10  32424.24 No         30+       1120000        44
11        NA NA         NA        5482900       157

In [89]:
amtcnt_fj %>% summarise(SUM_AMT = sum(Total_AMT))  # 결측값(NA) 때문에 합계가 NA로 나옴.

  SUM_AMT
1 NA

In [91]:
amtcnt_fj %>% summarise(SUM_AMT = sum(Total_AMT, na.rm = TRUE))  # 해결법(na.rm(remove) = TRUE)

  SUM_AMT
1 8847900

------

<html>
    <head>
        <style type="text/css">
            #table_header{
                text-align: center;
                color: crimson;
            }
            #table_data{
                text-align: left;
            }
        </style>
    </head>
    <body>
        <table>
            <caption style="text-align: center">기술통계함수의 종류</caption>
            <thead>
                <th id=table_header style="text-align: center;">기술통계함수</th>
                <th id=table_header style="text-align: center;">기능</th>
                <th id=table_header style="text-align: center;">설명</th>
            </thead>
            <tbody>
                <tr>
                    <td style="text-align: left;"><code>mean()</code></td>
                    <td style="text-align: center;">평균</td>
                    <td style="text-align: left;">데이터를 모두 더한 후 개수로 나눈 값</td>
                </tr>
                <tr>
                    <td style="text-align: left;"><code>median()</code></td>
                    <td style="text-align: center;">중앙값(중위수)</td>
                    <td style="text-align: left;">데이터를 크기 순으로 정렬했을 때 가운데에 위치하는 값<br>만약 데이터의 개수가 짝수이면 2개의 중앙값의 평균을 중앙값으로 사용한다.</td>
                </tr>
                <tr>
                    <td style="text-align: left;"><code>max()</code></td>
                    <td style="text-align: center;">최댓값</td>
                    <td style="text-align: left;">데이터를 크기 순으로 정렬했을 때 가장 큰 값</td>
                </tr>
                <tr>
                    <td style="text-align: left;"><code>min()</code></td>
                    <td style="text-align: center;">최솟값</td>
                    <td style="text-align: left;">데이터를 크기 순으로 정렬했을 때 가장 작은 값</td>
                </tr>
                <tr>
                    <td style="text-align: left;"><code>range()</code></td>
                    <td style="text-align: center;">범위</td>
                    <td style="text-align: left;">최댓값에서 최솟값까지의 범위</td>
                </tr>
                <tr>
                    <td style="text-align: left;"><code>quantile()</code></td>
                    <td style="text-align: center;">분위수</td>
                    <td style="text-align: left;">데이터를 크기 순으로 정렬했을 때 하위 25%, 50%, 75%에 위치한 데이터의 값<br>probs 옵션에 따라 "제1(Q1), 2(Q2), 3(Q3)사분위수"로 구분한다.</td>
                </tr>
                <tr>
                    <td style="text-align: left;"><code>var()</code></td>
                    <td style="text-align: center;">분산</td>
                    <td style="text-align: left;">데이터가 평균으로부터 퍼져 있는 정도를 나타내는 통계량<br>분산값이 작을수록 데이터가 평균값에 모여 있다.</td>
                </tr>
                <tr>
                    <td style="text-align: left;"><code>sd()</code></td>
                    <td style="text-align: center;">표준편차</td>
                    <td style="text-align: left;">데이터 값이 퍼져 있는 정도를 나타내는 통계량<br>표준편차값이 클수록 데이터가 넓게 퍼져 있다.</td>
                </tr>
                <tr>
                    <td style="text-align: left;"><code>kurtosi()</code></td>
                    <td style="text-align: center;">첨도(Kurtosis)</td>
                    <td style="text-align: left;">데이터 분포가 뾰족한 정도를 나타내는 통계량<br>첨도가 0보다 크면 정규분포에 비해 뾰족하고, 0보다 작으면 정규분포에 비해 평평하다.</td>
                </tr>
                <tr>
                    <td style="text-align: left;"><code>skew()</code></td>
                    <td style="text-align: center;">왜도(Skewness)</td>
                    <td style="text-align: left;">데이터 분포의 비대칭성을 나타내는 통계량<br>왜도의 절댓값이 클수록 비대칭이 심하다.<br>왜도가 음수이면 왼쪽으로, 양수이면 오른쪽으로 꼬리가 길어진다.</td>
                </tr>
            </tbody>
        </table>
    </body>
</html>